In [ ]:
%pip install ipython-sql

In [ ]:
%pip install psycopg2-binary

In [ ]:
%pip install sqlalchemy

In [6]:
%load_ext sql

Koneksi ke Postgres menggunakan SQL Magic

In [2]:
%env DATABASE_URL = postgresql://fifada_dwh_user:password@localhost:5432/fifada_dwh

env: DATABASE_URL=postgresql://fifada_dwh_user:password@localhost:5432/fifada_dwh

In [4]:
%%sql

select * from dim_customer limit 10

 * postgresql://fifada_dwh_user:***@localhost:5432/fifada_dwh
10 rows affected.

[(1, 'Richard', 'Hernandez', 'XXXXXXXXX', 'Brownsville', 'TX', '78521'),
 (2, 'Mary', 'Barrett', 'XXXXXXXXX', 'Littleton', 'CO', '80126'),
 (3, 'Ann', 'Smith', 'XXXXXXXXX', 'Caguas', 'PR', '00725'),
 (4, 'Mary', 'Jones', 'XXXXXXXXX', 'San Marcos', 'CA', '92069'),
 (5, 'Robert', 'Hudson', 'XXXXXXXXX', 'Caguas', 'PR', '00725'),
 (6, 'Mary', 'Smith', 'XXXXXXXXX', 'Passaic', 'NJ', '07055'),
 (7, 'Melissa', 'Wilcox', 'XXXXXXXXX', 'Caguas', 'PR', '00725'),
 (8, 'Megan', 'Smith', 'XXXXXXXXX', 'Lawrence', 'MA', '01841'),
 (9, 'Mary', 'Perez', 'XXXXXXXXX', 'Caguas', 'PR', '00725'),
 (10, 'Melissa', 'Smith', 'XXXXXXXXX', 'Stafford', 'VA', '22554')]

Koneksi ke Postgres menggunakan Pandas

In [5]:
conn_uri = 'postgresql://fifada_dwh_user:password@localhost:5432/fifada_dwh'

In [6]:
import pandas as pd
pd.read_sql('dim_customer', conn_uri)

       customer_id     fname      lname      email         city state zipcode
0                1   Richard  Hernandez  XXXXXXXXX  Brownsville    TX   78521
1                2      Mary    Barrett  XXXXXXXXX    Littleton    CO   80126
2                3       Ann      Smith  XXXXXXXXX       Caguas    PR   00725
3                4      Mary      Jones  XXXXXXXXX   San Marcos    CA   92069
4                5    Robert     Hudson  XXXXXXXXX       Caguas    PR   00725
...            ...       ...        ...        ...          ...   ...     ...
12430        12431      Mary       Rios  XXXXXXXXX      Kaneohe    HI   96744
12431        12432    Angela      Smith  XXXXXXXXX       Caguas    PR   00725
12432        12433  Benjamin     Garcia  XXXXXXXXX    Levittown    NY   11756
12433        12434      Mary      Mills  XXXXXXXXX       Caguas    PR   00725
12434        12435     Laura     Horton  XXXXXXXXX  Summerville    SC   29483

[12435 rows x 7 columns]

In [7]:
pd.read_sql('select * from dim_customer', conn_uri)

       customer_id     fname      lname      email         city state zipcode
0                1   Richard  Hernandez  XXXXXXXXX  Brownsville    TX   78521
1                2      Mary    Barrett  XXXXXXXXX    Littleton    CO   80126
2                3       Ann      Smith  XXXXXXXXX       Caguas    PR   00725
3                4      Mary      Jones  XXXXXXXXX   San Marcos    CA   92069
4                5    Robert     Hudson  XXXXXXXXX       Caguas    PR   00725
...            ...       ...        ...        ...          ...   ...     ...
12430        12431      Mary       Rios  XXXXXXXXX      Kaneohe    HI   96744
12431        12432    Angela      Smith  XXXXXXXXX       Caguas    PR   00725
12432        12433  Benjamin     Garcia  XXXXXXXXX    Levittown    NY   11756
12433        12434      Mary      Mills  XXXXXXXXX       Caguas    PR   00725
12434        12435     Laura     Horton  XXXXXXXXX  Summerville    SC   29483

[12435 rows x 7 columns]

In [8]:
query = '''
    SELECT status, count(*) AS order_count
    FROM dim_order
    GROUP BY 1
    ORDER BY 2 DESC
'''
pd.read_sql(query, conn_uri)

            status  order_count
0         COMPLETE        22899
1  PENDING_PAYMENT        15030
2       PROCESSING         8275
3          PENDING         7610
4           CLOSED         7556
5          ON_HOLD         3798
6  SUSPECTED_FRAUD         1558
7         CANCELED         1428
8   PAYMENT_REVIEW          729

In [ ]:
# konek ke postgres FIFADA
# 1. truncate table orders
# 2. definisikan kolom-kolom table fact_order_items(hard coded)
# 3. read csv orders dengan nama-nama kolom pada nomor 2
# 4. definisikan conn_uri
# 5. tulis csv ke sql menggunakan fungsi:
# df.to_sql(
#     'fact_order_items',
#     conn uri,
#     if_exists='replace',
#     index=False
# )

%env DATABASE_URL = postgresql://fifada_dwh_user:password@localhost:5432/fifada_dwh

env: DATABASE_URL=postgresql://fifada_dwh_user:password@localhost:5432/fifada_dwh

In [14]:
%%sql

truncate table fact_order_items

 * postgresql://fifada_dwh_user:***@localhost:5432/fifada_dwh
Done.

[]

In [16]:
%%sql

select * from fact_order_items limit 10

 * postgresql://fifada_dwh_user:***@localhost:5432/fifada_dwh
0 rows affected.

[]

In [ ]:
%%sql

copy fact_order_items from 'D:\Data Engineering\FIFADA\fact_order_items.csv' DELIMITER ',' CSV

In [ ]:
column = ['order_item_id', 'order_id', 'product_id', 'customer_id', 'date_id', 'quantity', 'subtotal', 'price_each']

In [22]:
import pandas as pd
df = pd.read_csv('fact_order_items.csv', header=None, names=column)

In [17]:
conn_uri = 'postgresql://fifada_dwh_user:password@localhost:5432/fifada_dwh'

In [23]:
df.to_sql(
    'fact_order_items',
    conn_uri,
    if_exists='replace',
    index=False
)

198

In [24]:
%%sql

select * from fact_order_items limit 10

 * postgresql://fifada_dwh_user:***@localhost:5432/fifada_dwh
10 rows affected.

[(1, 1, 957, 11599, '2013-07-25 00:00:00', 1, 299.98, 299.98),
 (172191, 68880, 1073, 1117, '2014-07-13 00:00:00', 1, 199.99, 199.99),
 (172164, 68866, 1073, 3890, '2014-06-20 00:00:00', 1, 199.99, 199.99),
 (172160, 68863, 1073, 3361, '2014-06-16 00:00:00', 1, 199.99, 199.99),
 (172151, 68861, 1073, 3031, '2014-06-13 00:00:00', 1, 199.99, 199.99),
 (172139, 68858, 1073, 10744, '2014-06-06 00:00:00', 1, 199.99, 199.99),
 (172136, 68855, 1073, 403, '2014-06-02 00:00:00', 1, 199.99, 199.99),
 (172133, 68851, 1073, 11193, '2014-05-26 00:00:00', 1, 199.99, 199.99),
 (172128, 68848, 1073, 6517, '2014-05-22 00:00:00', 1, 199.99, 199.99),
 (172109, 68842, 1073, 11268, '2014-05-15 00:00:00', 1, 199.99, 199.99)]